In [326]:
import pandas as pd
import numpy as np

In [327]:
# data = pd.read_csv('C:/Users/14481/OneDrive/桌面/openClose0110.txt', header=None)
proj_path='C:/Users/14481/OneDrive/桌面/295 Project/'
GSPC = pd.read_csv(proj_path+'^GSPC', header=None, delimiter=' ')

In [328]:
data.head(10)

      0       1      2
0    AA  31.170  32.27
1  AACE   8.150   9.35
2   AAE  23.790  23.75
3  AAII  16.990  19.99
4  AAON  20.250  16.90
5  AAPL  15.430  17.57
6   AAR  20.230  20.00
7   AAT  12.370  12.55
8  AATK   1.205   1.55
9  AAUK  11.800  12.92

In [329]:
GSPC.head(10)

            0      1      2      3      4        5      6
0  1950-01-03  16.66  16.66  16.66  16.66  1260000  16.66
1  1950-01-04  16.85  16.85  16.85  16.85  1890000  16.85
2  1950-01-05  16.93  16.93  16.93  16.93  2550000  16.93
3  1950-01-06  16.98  16.98  16.98  16.98  2010000  16.98
4  1950-01-09  17.08  17.08  17.08  17.08  2520000  17.08
5  1950-01-10  17.03  17.03  17.03  17.03  2160000  17.03
6  1950-01-11  17.09  17.09  17.09  17.09  2630000  17.09
7  1950-01-12  16.76  16.76  16.76  16.76  2970000  16.76
8  1950-01-13  16.67  16.67  16.67  16.67  3330000  16.67
9  1950-01-16  16.72  16.72  16.72  16.72  1460000  16.72

In [330]:
years = ['01','06','11']
months = ['11','12']
market_returns = {}
for year in years:
    for month in months:
        prefix = '20'+year+'-'+month
        start = GSPC[GSPC.iloc[:,0].str.startswith(prefix)].iloc[0,-3]
        end = GSPC[GSPC.iloc[:,0].str.startswith(prefix)].iloc[-1,-3]
        market_return = (end-start)/start
#         print(market_return)
        market_returns[prefix] = market_return

In [331]:
market_returns

{'2001-11': 0.0510561756295546,
 '2001-12': 0.016089919461899138,
 '2006-11': 0.023994560648043343,
 '2006-12': 0.015457754294019459,
 '2011-11': 0.02354138621663334,
 '2011-12': 0.010461360458949994}

In [332]:
# data1 = pd.read_csv('C:/Users/14481/OneDrive/桌面/295 Project/openClose0110.txt', header=None)
# list_comps = list(data1.iloc[:,0])
# type(list_comps)
# len(list_comps)

In [333]:
data2 = pd.read_csv(proj_path+"openClose0111.txt".format(year, month), header=None)
# list_comps = data2[data2.iloc[:,0].isin(list_comps)]
# len(list_comps)
# # data2.iloc[:,0].isin(['AA'])

In [335]:
for year in years:
    for idx, month in enumerate(months):
#         data1 = pd.read_csv('C:/Users/14481/OneDrive/桌面/295 Project/openClose{}{}.txt'.format(year, month), header=None)
        data2 = pd.read_csv(proj_path+"openClose{}{}.txt".format(year, month), header=None)
#         list_comps = data2[data2.iloc[:,0].isin(list_comps)]
#         open_price = data1[data1.iloc[:,0].isin(data2.iloc[:,0])].iloc[:,1]
#         close_price = data2[data2.iloc[:,0].isin(data2.iloc[:,0])].iloc[:,1]
        print(year,'-',month)
        open_price = [float(i) for i in data2[data2.iloc[:,2]!=0].iloc[:,1].tolist()]
        close_price = data2[data2.iloc[:,2]!=0].iloc[:,2].tolist()
        companies = np.array(data2[data2.iloc[:,2]!=0].iloc[:,0].tolist())
#         print(all(isinstance(i, float) for i in open_price))

        stock_returns = [(b-a)/b for a,b in zip(open_price, close_price)]
        Y_value = (stock_returns - market_returns['20{}-{}'.format(year,month)])*100
#         print(stock_returns)
#         print(Y_value)
        Y_value = np.reshape(Y_value, (Y_value.shape[0],1))
        companies = np.reshape(companies, (companies.shape[0],1))

#         print(Y_value.shape, companies.shape)
#         for x in zip(a, b):
#             f.write("{},{}\n".format(x[0], x[1]))
#         f.close()
        result = np.concatenate((companies,Y_value), axis=1)
        path = proj_path+"Yvalue{}{}.csv".format(year,month)
        np.savetxt(path, result, delimiter=",",fmt='%s')

01 - 11
01 - 12
06 - 11
06 - 12
11 - 11
11 - 12

In [254]:
# data2 = pd.read_csv("C:/Users/14481/OneDrive/桌面/295 Project/openClose0110.txt", header=None)
# open_price = data2[data2.iloc[:,2]!=0].iloc[:,1].tolist()
# close_price = data2[data2.iloc[:,2]!=0].iloc[:,2].tolist()
# # print(len(open_price),len(close_price))

# stock_returns = [(b-a)/b for a,b in zip(open_price, close_price)]
# # print(stock_returns)
# Y_value = (stock_returns - market_returns['2001-11'])*100
# print(Y_value)

[ -1.6968788    7.72860704  -5.27403862 ... -12.42269073  -0.40298962
   9.78799946]

In [94]:
data1[data1.iloc[:,0]==data2.iloc[1,0]]

    0      1      2
0  AA  31.17  32.27

In [149]:
list_comps = data2[data2.iloc[:,0].isin(list_comps)]

In [170]:
len(list_comps)

0